f16falcona46/STM8_Projects/STM8_Includes/stm8/stm8s_addr.h
#ifndef STM8S_REG_ADDR_DEFS
#define STM8S_REG_ADDR_DEFS

/* GPIO */
#define PA_ODR_ADDR 0x005000
#define PA_IDR_ADDR 0x005001
#define PA_DDR_ADDR 0x005002
#define PA_CR1_ADDR 0x005003
#define PA_CR2_ADDR 0x005004

#define PB_ODR_ADDR 0x005005
#define PB_IDR_ADDR 0x005006
#define PB_DDR_ADDR 0x005007
#define PB_CR1_ADDR 0x005008
#define PB_CR2_ADDR 0x005009

#define PC_ODR_ADDR 0x00500A
#define PC_IDR_ADDR 0x00500B
#define PC_DDR_ADDR 0x00500C
#define PC_CR1_ADDR 0x00500D
#define PC_CR2_ADDR 0x00500E

#define PD_ODR_ADDR 0x00500F
#define PD_IDR_ADDR 0x005010
#define PD_DDR_ADDR 0x005011
#define PD_CR1_ADDR 0x005012
#define PD_CR2_ADDR 0x005013

#define PE_ODR_ADDR 0x005014
#define PE_IDR_ADDR 0x005015
#define PE_DDR_ADDR 0x005016
#define PE_CR1_ADDR 0x005017
#define PE_CR2_ADDR 0x005018

#define PF_ODR_ADDR 0x005019
#define PF_IDR_ADDR 0x00501A
#define PF_DDR_ADDR 0x00501B
#define PF_CR1_ADDR 0x00501C
#define PF_CR2_ADDR 0x00501D

/* Flash */
#define FLASH_CR1_ADDR 0x00505A
#define FLASH_CR2_ADDR 0x00505B
#define FLASH_NCR2_ADDR 0x00505C
#define FLASH_FPR_ADDR 0x00505D
#define FLASH_NFPR_ADDR 0x00505E
#define FLASH_IAPSR_ADDR 0x00505F
#define FLASH_PUKR_ADDR 0x005062
#define FLASH_DUKR_ADDR 0x005064

/* External Interrupt */
#define EXTI_CR1_ADDR 0x0050A0
#define EXTI_CR2_ADDR 0x0050A1

/* Reset */
#define RST_SR_ADDR 0x0050B3

/* Clock */
#define CLK_ICKR_ADDR 0x0050C0
#define CLK_ECKR_ADDR 0x0050C1
#define CLK_CMSR_ADDR 0x0050C3
#define CLK_SWR_ADDR 0x0050C4
#define CLK_SWCR_ADDR 0x0050C5
#define CLK_CKDIVR_ADDR 0x0050C6
#define CLK_PCKENR1_ADDR 0x0050C7
#define CLK_CSSR_ADDR 0x0050C8
#define CLK_CCOR_ADDR 0x0050C9
#define CLK_PCKENR2_ADDR 0x0050CA
#define CLK_HSITRIMR_ADDR 0x0050CC
#define CLK_SWIMCCR_ADDR 0x0050CD

/* Watchdog */
#define WWDG_CR_ADDR 0x0050D1
#define WWDG_WR_ADDR 0x0050D2
#define IWDG_KR_ADDR 0x0050E0
#define IWDG_PR_ADDR 0x0050E1
#define IWDG_RLR_ADDR 0x0050E2

/* AWU */
#define AWU_CSR1_ADDR 0x0050F0
#define AWU_APR_ADDR 0x0050F1
#define AWU_TBR_ADDR 0x0050F2

/* BEEP */
#define BEEP_CSR_ADDR 0x0050F3

/* SPI */
#define SPI_CR1_ADDR 0x005200
#define SPI_CR2_ADDR 0x005201
#define SPI_ICR_ADDR 0x005202
#define SPI_SR_ADDR 0x005203
#define SPI_DR_ADDR 0x005204
#define SPI_CRCPR_ADDR 0x005205
#define SPI_RXCRCR_ADDR 0x005206
#define SPI_TXCRCR_ADDR 0x005207

/* I2C */
#define I2C_CR1_ADDR 0x005210
#define I2C_CR2_ADDR 0x005211
#define I2C_FREQR_ADDR 0x005212
#define I2C_OARL_ADDR 0x005213
#define I2C_OARH_ADDR 0x005214
#define I2C_DR_ADDR 0x005216
#define I2C_SR1_ADDR 0x005217
#define I2C_SR2_ADDR 0x005218
#define I2C_SR3_ADDR 0x005219
#define I2C_ITR_ADDR 0x00521A
#define I2C_CCRL_ADDR 0x00521B
#define I2C_CCRH_ADDR 0x00521C
#define I2C_TRISER_ADDR 0x00521D
#define I2C_PECR_ADDR 0x00521E

/* UART */
#define UART1_SR_ADDR 0x005230
#define UART1_DR_ADDR 0x005231
#define UART1_BRR1_ADDR 0x005232
#define UART1_BRR2_ADDR 0x005233
#define UART1_CR1_ADDR 0x005234
#define UART1_CR2_ADDR 0x005235
#define UART1_CR3_ADDR 0x005236
#define UART1_CR4_ADDR 0x005237
#define UART1_CR5_ADDR 0x005238
#define UART1_GTR_ADDR 0x005239
#define UART1_PSCR_ADDR 0x00523A

/* Timers */
#define TIM1_CR1_ADDR 0x005250
#define TIM1_CR2_ADDR 0x005251
#define TIM1_SMCR_ADDR 0x005252
#define TIM1_ETR_ADDR 0x005253
#define TIM1_IER_ADDR 0x005254
#define TIM1_SR1_ADDR 0x005255
#define TIM1_SR2_ADDR 0x005256
#define TIM1_EGR_ADDR 0x005257
#define TIM1_CCMR1_ADDR 0x005258
#define TIM1_CCMR2_ADDR 0x005259
#define TIM1_CCMR3_ADDR 0x00525A
#define TIM1_CCMR4_ADDR 0x00525B
#define TIM1_CCER1_ADDR 0x00525C
#define TIM1_CCER2_ADDR 0x00525D
#define TIM1_CNTRH_ADDR 0x00525E
#define TIM1_CNTRL_ADDR 0x00525F
#define TIM1_PSCRH_ADDR 0x005260
#define TIM1_PSCRL_ADDR 0x005261
#define TIM1_ARRH_ADDR 0x005262
#define TIM1_ARRL_ADDR 0x005263
#define TIM1_RCR_ADDR 0x005264
#define TIM1_CCR1H_ADDR 0x005265
#define TIM1_CCR1L_ADDR 0x005266
#define TIM1_CCR2H_ADDR 0x005267
#define TIM1_CCR2L_ADDR 0x005268
#define TIM1_CCR3H_ADDR 0x005269
#define TIM1_CCR3L_ADDR 0x00526A
#define TIM1_CCR4H_ADDR 0x00526B
#define TIM1_CCR4L_ADDR 0x00526C
#define TIM1_BKR_ADDR 0x00526D
#define TIM1_DTR_ADDR 0x00526E
#define TIM1_OISR_ADDR 0x00526F
#define TIM2_CR1_ADDR 0x005300
#define TIM2_IER_ADDR 0x005303
#define TIM2_SR1_ADDR 0x005304
#define TIM2_SR2_ADDR 0x005305
#define TIM2_EGR_ADDR 0x005306
#define TIM2_CCMR1_ADDR 0x005307
#define TIM2_CCMR2_ADDR 0x005308
#define TIM2_CCMR3_ADDR 0x005309
#define TIM2_CCER1_ADDR 0x00530A
#define TIM2_CCER2_ADDR 0x00530B
#define TIM2_CNTRH_ADDR 0x00530C
#define TIM2_CNTRL_ADDR 0x00530D
#define TIM2_PSCR_ADDR 0x00530E
#define TIM2_ARRH_ADDR 0x00530F
#define TIM2_ARRL_ADDR 0x005310
#define TIM2_CCR1H_ADDR 0x005311
#define TIM2_CCR1L_ADDR 0x005312
#define TIM2_CCR2H_ADDR 0x005313
#define TIM2_CCR2L_ADDR 0x005314
#define TIM2_CCR3H_ADDR 0x005315
#define TIM2_CCR3L_ADDR 0x005316
#define TIM4_CR1_ADDR 0x005340
#define TIM4_IER_ADDR 0x005343
#define TIM4_SR_ADDR 0x005344
#define TIM4_EGR_ADDR 0x005345
#define TIM4_CNTR_ADDR 0x005346
#define TIM4_PSCR_ADDR 0x005347
#define TIM4_ARR_ADDR 0x005348

/* ADC */
#define ADC_DBxR ((volatile uint8_t*)0x0053E0)
#define ADC_CSR_ADDR 0x005400
#define ADC_CR1_ADDR 0x005401
#define ADC_CR2_ADDR 0x005402
#define ADC_CR3_ADDR 0x005403
#define ADC_DRH_ADDR 0x005404
#define ADC_DRL_ADDR 0x005405
#define ADC_TDRH_ADDR 0x005406
#define ADC_TDRL_ADDR 0x005407
#define ADC_HTRH_ADDR 0x005408
#define ADC_HTRL_ADDR 0x005409
#define ADC_LTRH_ADDR 0x00540A
#define ADC_LTRL_ADDR 0x00540B
#define ADC_AWSRH_ADDR 0x00540C
#define ADC_AWSRL_ADDR 0x00540D
#define ADC_AWCRH_ADDR 0x00540E
#define ADC_AWCRL_ADDR 0x00540F

/* CPU */
#define A_ADDR 0x007F00
#define PCE_ADDR 0x007F01
#define PCH_ADDR 0x007F02
#define PCL_ADDR 0x007F03
#define XH_ADDR 0x007F04
#define XL_ADDR 0x007F05
#define YH_ADDR 0x007F06
#define YL_ADDR 0x007F07
#define SPH_ADDR 0x007F08
#define SPL_ADDR 0x007F09
#define CCR_ADDR 0x007F0A
#define CFG_GCR_ADDR 0x007F60

/* ITC */
#define ITC_SPR1_ADDR 0x007F70
#define ITC_SPR2_ADDR 0x007F71
#define ITC_SPR3_ADDR 0x007F72
#define ITC_SPR4_ADDR 0x007F73
#define ITC_SPR5_ADDR 0x007F74
#define ITC_SPR6_ADDR 0x007F75
#define ITC_SPR7_ADDR 0x007F76
#define ITC_SPR8_ADDR 0x007F77

/* Debug */
#define SWIM_CSR_ADDR 0x007F80
#define DM_BK1RE_ADDR 0x007F90
#define DM_BK1RH_ADDR 0x007F91
#define DM_BK1RL_ADDR 0x007F92
#define DM_BK2RE_ADDR 0x007F93
#define DM_BK2RH_ADDR 0x007F94
#define DM_BK2RL_ADDR 0x007F95
#define DM_CR1_ADDR 0x007F96
#define DM_CR2_ADDR 0x007F97
#define DM_CSR1_ADDR 0x007F98
#define DM_CSR2_ADDR 0x007F99
#define DM_ENFCTR_ADDR 0x007F9A

#endif